# GridlinesRotation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpacingRule..::..GridlinesRotation Property
SpacingRule Class See Also
---
An additional rotation to be applied to this set of grid lines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double GridlinesRotation { get; set; }
```

Visual Basic
---
```text
Public Property GridlinesRotation As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double GridlinesRotation {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | Thrown when angle is outside of the range ( -PI/2, PI/2 ). |

# See Also
SpacingRule Class
Autodesk.Revit.DB Namespace